const quizQuestions = [
    {
        question: "ഇന്ത്യൻ എവിഡൻസ് ആക്ട്, പാസാക്കിയ വർഷം ഏതാണ്?",
        options: ["1872 മാർച്ച് 15", "1872 സെപ്റ്റംബർ", "1873 ജനുവരി 1", "1872 ജനുവരി 1"],
        correct: 0
    },
    {
        question: "ഇന്ത്യൻ എവിഡൻസ് ആക്ട് നിലവിൽ വന്നത്?",
        options: ["ജനുവരി 1, 1872", "മാർച്ച് 15, 1872", "സെപ്റ്റംബർ 1, 1872", "ഒക്ടോബർ 1, 1872"],
        correct: 2
    },
    {
        question: "ഇന്ത്യൻ എവിഡൻസ് ആക്ട് 1872 ആരുടെ നേതൃത്വത്തിലുള്ള നിയമ കമ്മീഷൻ ആണ് തയ്യാറാക്കിയത്",
        options: ["ലോർഡ് ഡൽഹൗസി", "ലോർഡ് കഴ്സൺ", "ലോർഡ് മെക്കാളെ", "ലോർഡ് കാനിംഗ്"],
        correct: 2
    },
    {
        question: "ഇന്ത്യൻ എവിഡൻസ് ആക്ടിൽ തുടക്കത്തിൽ പരിഗണിക്കപ്പെടാതിരുന്ന തെളിവുകൾ?",
        options: ["വാചിക തെളിവുകൾ", "രേഖാപരമായ തെളിവുകൾ", "സാക്ഷികളുടെ മൊഴി", "ഡിജിറ്റൽ/ഇലക്ട്രോണിക് തെളിവുകൾ"],
        correct: 3
    },
    {
        question: "ഇന്ത്യൻ എവിഡൻസ് ആക്ടിന് (IEA) 1872-ന് പകരമായി വന്ന പുതിയ നിയമം?",
        options: ["ഭാരതീയ ന്യായ സംഹിത, 2023", "ഭാരതീയ നാഗരിക് സുരക്ഷാ സംഹിത, 2023", "ഭാരതീയ സാക്ഷ്യ അധിനിയമം, 2023", "ഭാരതീയ ദണ്ഡ് സംഹിത, 2023"],
        correct: 2
    },
    {
        question: "ഭാരതീയ സാക്ഷ്യ അധിനിയമം, 2023 ഏത് തീയതി മുതൽ പ്രാബല്യത്തിൽ വന്നു ?",
        options: ["ജനുവരി 1, 2024", "ഏപ്രിൽ 1, 2024", "ജൂലൈ 1, 2024", "ഡിസംബർ 25, 2023"],
        correct: 2
    },
    {
        question: "ഭാരതീയ സാക്ഷ്യ അധിനിയമം, 2023-ൽ എത്ര അധ്യായങ്ങളുണ്ട്?",
        options: ["11", "12", "13", "14"],
        correct: 1
    },
    {
        question: "ഭാരതീയ സാക്ഷ്യ അധിനിയമം, 2023-ൽ എത്ര വകുപ്പുകളുണ്ട്?",
        options: ["167", "170", "175", "180"],
        correct: 1
    },
    {
        question: "ഭാരതീയ സാക്ഷ്യ അധിനിയമം, 2023-ന്റെ ഘടനയിൽ എത്ര ഭാഗങ്ങളുണ്ട്?",
        options: ["3", "4", "5", "6"],
        correct: 1
    },
    {
        question: "ഭാരതീയ സാക്ഷ്യ അധിനിയമം, 2023-ൽ എത്ര പട്ടികകളുണ്ട് (Schedule)?",
        options: ["0", "1", "2", "3"],
        correct: 1
    },
    {
        question: "സ്റ്റാൻഡിംഗ് കമ്മിറ്റി ഓൺ ഹോം അഫയേഴ്സിന്റെ ചെയർമാൻ ആരായിരുന്നു?",
        options: ["അമിത് ഷാ", "പി.സി. മോഹൻ", "ബ്രിജി ലാൽ", "രാജീവ് കുമാർ"],
        correct: 2
    },
    {
        question: "സ്റ്റാൻഡിംഗ് കമ്മിറ്റി റിപ്പോർട്ട് സമർപ്പിച്ചത് എന്ന്?",
        options: ["ഒക്ടോബർ 20, 2023", "നവംബർ 10, 2023", "ഡിസംബർ 1, 2023", "ഡിസംബർ 25, 2023"],
        correct: 1
    },
    {
        question: "'ഡോക്യുമെന്റ്' എന്നതിൽ വ്യക്തമായി ഉൾപ്പെടുന്നവ ഏത് സെക്ഷനിൽ ആണ് ?",
        options: ["സെക്ഷൻ 2(d)", "സെക്ഷൻ 3(d)", "സെക്ഷൻ 2(c)", "സെക്ഷൻ 2"],
        correct: 0
    },
    {
        question: "ഭാരതീയ സാക്ഷ്യ അധിനിയമം, 2023 ലെ സെക്ഷൻ 2(d) പ്രകാരം 'ഡോക്യുമെന്റ്' എന്നതിൽ വ്യക്തമായി ഉൾപ്പെടുന്നവ?",
        options: ["വാചിക പ്രസ്താവനകൾ", "സാക്ഷികളുടെ മൊഴികൾ", "കുറ്റസമ്മതം", "ഇലക്ട്രോണിക്, ഡിജിറ്റൽ രേഖകൾ"],
        correct: 3
    },
    {
        question: "'തെളിവ്' എന്നതിന്റെ സെക്ഷൻ ?",
        options: ["സെക്ഷൻ 2(a)", "സെക്ഷൻ 2(d)", "സെക്ഷൻ 2(e)", "സെക്ഷൻ 2(f)"],
        correct: 2
    },
    {
        question: "BSA പ്രകാരം തെളിവുകൾ എത്ര തരം ?",
        options: ["1", "2", "3", "4"],
        correct: 1
    },
    {
        question: "ഭാരതീയ സാക്ഷ്യ അധിനിയമം, 2023 ലെ സെക്ഷൻ 2(e) പ്രകാരം വാചിക തെളിവ്' എന്നതിൽ ഉൾപ്പെടുന്നത്?",
        options: ["ഇലക്ട്രോണിക് രീതിയിലുള്ള സാക്ഷികളുടെ മൊഴി", "കോടതിക്ക് സമർപ്പിക്കുന്ന രേഖകൾ", "ഡിജിറ്റൽ രേഖകള്", "പോലീസ് റിപ്പോർട്ടുകൾ"],
        correct: 0
    },
    {
        question: "വിഷയത്തിലെ വസ്തുതകൾ\" (facts in issue) എന്നത് ഏത് സെക്ഷൻ പ്രകരം ആണ് ?",
        options: ["സെക്ഷൻ 2(a)", "സെക്ഷൻ 2(h)", "സെക്ഷൻ 2(g)", "സെക്ഷൻ 2(d)"],
        correct: 2
    },
    {
        question: "വിഷയത്തിലെ വസ്തുതകൾ (facts in issue) എന്നത് എന്തിനെ സൂചിപ്പിക്കുന്നു",
        options: ["കേസുമായി ബന്ധമില്ലാത്ത വസ്തുതകൾ", "കോടതിക്ക് പരിഗണിക്കാനാവാത്ത വസ്തുതകൾ", "ഒരു കേസിലെ അവകാശം ബാധ്യത,അപാകത സംബന്ധിച്ച നിലനിൽപ്പ്,സ്വഭാവം,വ്യാപ്തി സംബന്ധിച്ച നിർണായക വസ്തുത", "സാക്ഷികൾക്ക് നേരിട്ടറിയാവുന്ന വസ്തുതകൾ മാത്രം"],
        correct: 2
    },
    {
        question: "ഭാരതീയ സാക്ഷ്യ അധിനിയമം, 2023 ലെ സെക്ഷൻ 2(k) പ്രകാരം ഒരു വസ്തുത എപ്പോഴാണ് 'പ്രസക്തം' (Relevant) ആകുന്നത്?",
        options: ["അത് നേരിട്ടുള്ള തെളിവാകുമ്പോൾ", "അത് പോലീസ് റിപ്പോർട്ടിൽ ഉൾപ്പെടുമ്പോൾ", "അത് ഒരു വ്യക്തിയുടെ അഭിപ്രായമാകുമ്പോൾ", "ഒരു വസ്തുത, ഈ അധിനിയമത്തിലെ വ്യവസ്ഥകൾ പ്രകാരം മറ്റൊരു വസ്തുതയുമായി ബന്ധപ്പെട്ടിരിക്കുമ്പോൾ"],
        correct: 3
    },
    {
        question: "കുറ്റസമ്മതത്തെ പറ്റി പറയുന്ന സെക്ഷൻ ?",
        options: ["സെക്ഷൻ 32", "സെക്ഷൻ 23", "സെക്ഷൻ 21", "സെക്ഷൻ 22"],
        correct: 3
    },
    {
        question: "ഒരു കുറ്റാരോപിതൻ നൽകുന്ന കുറ്റസമ്മതം പ്രസക്തമാകുന്നത് എപ്പോൾ?",
        options: ["അത് പോലീസ് ഉദ്യോഗസ്ഥന്റെ സാന്നിധ്യത്തിൽ നൽകുമ്പോൾ", "അത് രഹസ്യമായി വാഗ്ദാനം ചെയ്യപ്പെടുമ്പോൾ", "പ്രേരണ ഭീഷണി നിർബന്ധം വാഗ്ദാനം മൂലമുണ്ടായ മനോഭാവം നീക്കം ചെയ്യപ്പെട്ട ശേഷമുള്ള കുറ്റസമ്മതം", "അത് മദ്യലഹരിയിൽ നൽകുമ്പോൾ"],
        correct: 2
    },
    {
        question: "ഒരു പോലീസ് ഉദ്യോഗസ്ഥനോട് നൽകിയ കുറ്റസമ്മതം, ഏതെങ്കിലും കുറ്റം ആരോപിക്കപ്പെട്ട വ്യക്തിക്കെതിരെ തെളിവാകയില്ല എന്ന് പറയുന്ന സെക്ഷൻ ?",
        options: ["സെക്ഷൻ 23", "സെക്ഷൻ 22", "സെക്ഷൻ 32", "സെക്ഷൻ 21"],
        correct: 0
    },
    {
        question: "ഒന്നിലധികം വ്യക്തികൾ ഒരേ കുറ്റത്തിന് ഒരുമിച്ച് വിചാരണ ചെയ്യപ്പെടുമ്പോൾ, അവരിൽ ഒരാൾ നൽകിയ കുറ്റസമ്മതം തെളിവായി (proved) സ്വീകരിക്കപ്പെടും എന്ന് പറയുന്ന സെക്ഷൻ ?",
        options: ["സെക്ഷൻ 25", "സെക്ഷൻ 2(d)", "സെക്ഷൻ 23", "സെക്ഷൻ 24"],
        correct: 3
    },
    {
        question: "ഒന്നിലധികം വ്യക്തികൾ ഒരേ കുറ്റത്തിന് ഒരുമിച്ച് വിചാരണ ചെയ്യപ്പെടുമ്പോൾ, അവരിൽ ഒരാൾ നൽകിയ കുറ്റസമ്മതം തെളിവായി (proved) സ്വീകരിക്കപ്പെട്ടാൽ?",
        options: ["അത് കുറ്റസമ്മതം നൽകിയ വ്യക്തിക്കെതിരെ മാത്രം പരിഗണിക്കാം", "അത് മറ്റ് വ്യക്തികൾക്കെതിരെ ഒരു കാരണവശാലും പരിഗണിക്കില്ല", "അത് നൽകിയ വ്യക്തിക്കെതിരെ മാത്രമല്ല, മറ്റ് വ്യക്തികൾക്കെതിരെയും പരിഗണനയിൽ എടുക്കാം", "ആ കുറ്റസമ്മതം തെളിവായി കണക്കാക്കില്ല."],
        correct: 2
    },
    {
        question: "A, B എന്നിവരെ C-യുടെ കൊലപാതകത്തിന് ഒരുമിച്ച് വിചാരണ ചെയ്യുമ്പോൾ, A 'ഞാനും B-യും ചേർന്ന് C-യെ കൊന്നു' എന്ന് പറഞ്ഞാൽ, ഈ കുറ്റസമ്മതത്തിന്റെ ഫലം എന്തായിരിക്കും?",
        options: ["ഈ കുറ്റസമ്മതം A-യുടെ എതിരായി മാത്രം കോടതിക്ക് പരിഗണിക്കാം", "ഈ കുറ്റസമ്മതം B-യുടെ എതിരായി ഒരു കാരണവശാലും പരിഗണിക്കില്ല.", "ഈ കുറ്റസമ്മതം A-യുടെയും B-യുടെയും എതിരായി കോടതിക്ക് പരിഗണിക്കാം.", "ഈ പ്രസ്താവന ഒരു കുറ്റസമ്മതമായി കണക്കാക്കില്ല."],
        correct: 2
    },
    {
        question: "കമ്മീഷൻ്റെ ഭാരതീയ സാക്ഷ്യ അധിനിയമിൽ ഏതു സെക്ഷനാണ് പോലീസ് ഉദ്യോഗസ്ഥനോട് നടത്തുന്ന കുറ്റസമ്മതം ഏതെങ്കിലും കുറ്റകൃത്യത്തിൽ കുറ്റാരോപിതനായ വ്യക്തിക്കെതിരെ തെളിയിക്കാൻ പാടില്ല എന്നു പറയുന്ന ഒരു വകുപ്പ്?",
        options: ["സെക്ഷൻ 27", "സെക്ഷൻ 26", "സെക്ഷൻ 23", "സെക്ഷൻ 33"],
        correct: 2
    },
    {
        question: "ഭാരതീയ സാക്ഷ്യ അധിനിയം 2023 പ്രകാരം 'രേഖ' എന്ന നിർവചനത്തിൽ ഉൾപ്പെടുന്നത് ഏത്/ ഏവ?",
        options: ["i", "ii, iii, iv", "iv", "i, ii, iii, iv, v"],
        correct: 3
    },
    {
        question: "മരണമൊഴിയെക്കുറിച്ച് പ്രതിപാദിക്കുന്ന ഭാരതീയ സാക്ഷ്യ അധിനിയത്തിലെ വകുപ്പ് 26(a) ആണ് പ്രസ്‌താവന. പ്രസ്‌താവന b: ഒരു മജിസ്ട്രേറ്റിനോ ചികിത്സിക്കുന്ന ഡോക്‌ടർക്കോ, പോലീസ് ഉദ്യോഗസ്ഥനോ, പൊതുജനത്തിനോ, സ്വകാര്യ വ്യക്തിക്കോ മരണമൊഴി രേഖപ്പെടുത്താവുന്നതാണ്. എന്നാൽ ചികിത്സിക്കുന്ന ഡോക്ടർ രേഖപ്പെടുത്തുന്ന മരണമൊഴിക്കാണ് തെളിവ് മൂല്യം കൂടുതൽ.",
        options: ["പ്രസ്താവന (a), (b) തെറ്റ്", "പ്രസ്താവന (a) മാത്രം ശരി", "പ്രസ്താവന (a), (b) ശരി", "പ്രസ്താവന (b) മാത്രം ശരി"],
        correct: 1
    },
    {
        question: "ചതിയെക്കുറിച്ച് പരാമർശിക്കുന്ന BSA വകുപ്പ്",
        options: ["സെക്ഷൻ 26", "സെക്ഷൻ 39", "സെക്ഷൻ 45", "ഇവയൊന്നുമല്ല"],
        correct: 1
    },
    {
        question: "കസ്‌റ്റഡിലെ പ്രതി കുറ്റസമ്മതം നടത്തുന്നു. ഇതുമായി ബന്ധപ്പെട്ട ശരിയായ പ്രസ്താവന ഏത്?",
        options: ["മുതിർന്ന പോലീസ് ഉദ്യോഗസ്ഥൻ മുമ്പാകെയാണ് കുറ്റസമ്മതം നടത്തേണ്ടത്", "കുറ്റസമ്മതം ഒരു സാഹചര്യത്തിലും തെളിവായി സ്വീകാര്യമല്ല", "കുറ്റസമ്മതം പോലീസ് നിർബന്ധമായും വിഡിയോ ചിത്രീകരിക്കണം", "ഈ കുറ്റസമ്മതം മജി‌സ്ട്രേറ്റിൻ്റെ സാന്നിധ്യത്തിൽ വെച്ചാണെങ്കിൽ പ്രതിക്കതിരെ തെളിയിക്കാവുന്നതാണ്."],
        correct: 3
    },
    {
        question: "പോലീസ് കസ്‌റ്റഡിയിൽ ഇരിക്കെ പ്രതി പോലീസിന് മൊഴി നല്കുന്നു. ആ മൊഴിയുടെ അടിസ്ഥ‌ാനത്തിൽ പോലീസ് ആ ആയുധം പ്രതി പറഞ്ഞ സ്‌ഥലത്തു നിന്നും കണ്ടെടുക്കുന്നുവെങ്കിൽ",
        options: ["ആയുധം സംബന്ധിച്ച പ്രതി നല്‌കിയ വിവരം അത്രത്തോളം പ്രതിക്കെതിരെ തെളിയിക്കാവുന്നതാണ്", "പോലീസ് കസ്റ്റഡിയിൽ ഇരിക്കെയാണ് പ്രതി മൊഴി നല്കിയത് എന്നതിനാൽ ആ മൊഴി പ്രതിക്കെതിരെ തെളിയിക്കാവുന്നതല്ല", "പ്രതി കുറ്റം ചെയ്‌തുവെന്നത് തെളിഞ്ഞു", "പ്രതിയുടെ മൊഴി പോലീസിനോടുള്ള കുറ്റസമ്മതം അല്ലാത്തപക്ഷം മാത്രം"],
        correct: 0
    },
    {
        question: "BSA യിലെ വകുപ്പ് 23 പ്രകാരം പ്രതിപാദിക്കുന്നത്",
        options: ["ഒരു പോലീസ് ഉദ്യാഗസ്ഥനോട് നടത്തുന്ന യാതൊരു കുറ്റസമ്മതവും കുറ്റം ആരോപിക്കപ്പെട്ട വ്യക്തിക്കെതിരെ തെളിയിക്കുവാൻ പാടില്ല", "കുറ്റസമ്മതം ക്രിമിനൽ നടപടിയിൽ എപ്പോഴാണ് അപ്രസക്തം എന്ന് പ്രതിപാദിക്കുന്ന വകുപ്പ്", "ചുരുക്കപ്പേര്, നിയമം സാധകമായ സാഹചര്യങ്ങൾ, പ്രാരംഭം എന്നിവയെക്കുറിച്ച് പ്രതിപാദിക്കുന്ന വകുപ്പ്", "ശരിയായവ മാത്രം തിരഞ്ഞെടുക്കുക."],
        correct: 0
    },
    {
        question: "ഭാരതീയസാക്ഷ്യഅധിനിയം (BSA) പ്രകാരം എവിഡൻസ് എന്ന പദം നിർവ്വചിക്കുന്നത് ഏതു വകുപ്പിലാണ്?",
        options: ["സെക്ഷൻ - 1", "സെക്ഷൻ - 2", "സെക്ഷൻ - 3", "സെക്ഷൻ - 4"],
        correct: 2
    },
    {
        question: "സാക്ഷിയെ ചോദ്യം ചെയ്യാനുള്ള ശ്രമം (വിസ്‌താരക്രമം)",
        options: ["Cross-Re-Chief", "Chief-Re-Cross", "Chief-Cross-Re", "Re-Chief-Cross"],
        correct: 2
    }
];
