const quizQuestions = [
    {
        question: "കമ്മീഷൻ്റെ ഭാരതീയ സാക്ഷ്യ അധിനിയമിൽ ഏതു സെക്ഷനാണ് പോലീസ് ഉദ്യോഗസ്ഥനോട് നടത്തുന്ന കുറ്റസമ്മതം ഏതെങ്കിലും കുറ്റകൃത്യത്തിൽ കുറ്റാരോപിതനായ വ്യക്തിക്കെതിരെ തെളിയിക്കാൻ പാടില്ല എന്നു പറയുന്ന ഒരു വകുപ്പ്?",
        options: ["സെക്ഷൻ 27", "സെക്ഷൻ 26", "സെക്ഷൻ 23", "സെക്ഷൻ 33"],
        correct: 2
    },
    {
        question: "ഭാരതീയ സാക്ഷ്യ അധിനിയം 2023 പ്രകാരം 'രേഖ' എന്ന നിർവചനത്തിൽ ഉൾപ്പെടുന്നത് ഏത്/ ഏവ?",
        options: ["i", "ii, iii, iv", "iv", "i, ii, iii, iv"],
        correct: 3
    },
    {
        question: "മരണമൊഴിയെക്കുറിച്ച് പ്രതിപാദിക്കുന്ന ഭാരതീയ സാക്ഷ്യ അധിനിയത്തിലെ വകുപ്പ് 26(a) ആണ് പ്രസ്‌താവന. പ്രസ്‌താവന b: ഒരു മജിസ്ട്രേറ്റിനോ ചികിത്സിക്കുന്ന ഡോക്‌ടർക്കോ, പോലീസ് ഉദ്യോഗസ്ഥനോ, പൊതുജനത്തിനോ, സ്വകാര്യ വ്യക്തിക്കോ മരണമൊഴി രേഖപ്പെടുത്താവുന്നതാണ്. എന്നാൽ ചികിത്സിക്കുന്ന ഡോക്ടർ രേഖപ്പെടുത്തുന്ന മരണമൊഴിക്കാണ് തെളിവ് മൂല്യം കൂടുതൽ.",
        options: ["പ്രസ്താവന (a), (b) തെറ്റ്", "പ്രസ്താവന (a) മാത്രം ശരി", "പ്രസ്താവന (a), (b) ശരി", "പ്രസ്താവന (b) മാത്രം ശരി"],
        correct: 1
    },
    {
        question: "കസ്‌റ്റഡിലെ പ്രതി കുറ്റസമ്മതം നടത്തുന്നു. ഇതുമായി ബന്ധപ്പെട്ട ശരിയായ പ്രസ്താവന ഏത്?",
        options: ["മുതിർന്ന പോലീസ് ഉദ്യോഗസ്ഥൻ മുമ്പാകെയാണ് കുറ്റസമ്മതം നടത്തേണ്ടത്", "കുറ്റസമ്മതം ഒരു സാഹചര്യത്തിലും തെളിവായി സ്വീകാര്യമല്ല", "കുറ്റസമ്മതം പോലീസ് നിർബന്ധമായും വിഡിയോ ചിത്രീകരിക്കണം", "ഈ കുറ്റസമ്മതം മജി‌സ്ട്രേറ്റിൻ്റെ സാന്നിധ്യത്തിൽ വെച്ചാണെങ്കിൽ പ്രതിക്കതിരെ തെളിയിക്കാവുന്നതാണ്."],
        correct: 3
    },
    {
        question: "പോലീസ് കസ്‌റ്റഡിയിൽ ഇരിക്കെ പ്രതി പോലീസിന് മൊഴി നല്കുന്നു. ആ മൊഴിയുടെ അടിസ്ഥ‌ാനത്തിൽ പോലീസ് ആ ആയുധം പ്രതി പറഞ്ഞ സ്‌ഥലത്തു നിന്നും കണ്ടെടുക്കുന്നുവെങ്കിൽ",
        options: ["ആയുധം സംബന്ധിച്ച പ്രതി നല്‌കിയ വിവരം അത്രത്തോളം പ്രതിക്കെതിരെ തെളിയിക്കാവുന്നതാണ്", "പോലീസ് കസ്റ്റഡിയിൽ ഇരിക്കെയാണ് പ്രതി മൊഴി നല്കിയത് എന്നതിനാൽ ആ മൊഴി പ്രതിക്കെതിരെ തെളിയിക്കാവുന്നതല്ല", "പ്രതി കുറ്റം ചെയ്‌തുവെന്നത് തെളിഞ്ഞു", "പ്രതിയുടെ മൊഴി പോലീസിനോടുള്ള കുറ്റസമ്മതം അല്ലാത്തപക്ഷം മാത്രം"],
        correct: 0
    },
    {
        question: "ഭാരതീയസാക്ഷ്യഅധിനിയം (BSA) പ്രകാരം എവിഡൻസ് എന്ന പദം നിർവ്വചിക്കുന്നത് ഏതു വകുപ്പിലാണ്?",
        options: ["സെക്ഷൻ - 1", "സെക്ഷൻ - 2", "സെക്ഷൻ - 3", "സെക്ഷൻ - 4"],
        correct: 2
    },
    {
        question: "സാക്ഷിയെ വിസ്‌തരിക്കേണ്ട ക്രമത്തെക്കുറിച്ച് പ്രതിപാദിക്കുന്ന വകുപ്പ് (വിസ്‌താരക്രമം: മുഖ്യവിസ്താരം - എതിർ വിസ്താരം - പുനർവിസ്താരം) - ചോദ്യം ചെയ്യാനുള്ള ശരിയായ ക്രമം ഏത്?",
        options: ["Cross-Re-Chief", "Chief-Re-Cross", "Chief-Cross-Re", "Re-Chief-Cross"],
        correct: 2
    },
    {
        question: "ഭാരതീയ സാക്ഷ്യ അധിനിയമിൽ ഏതു സെക്ഷനാണ് പോലീസ് ഉദ്യോഗസ്ഥനോട് നടത്തുന്ന കുറ്റസമ്മതം ഏതെങ്കിലും കുറ്റകൃത്യത്തിൽ കുറ്റാരോപിതനായ വ്യക്തിക്കെതിരെ തെളിയിക്കാൻ പാടില്ല എന്ന് പറഞ്ഞിട്ടുള്ളത്?",
        options: ["സെക്ഷൻ 27", "സെക്ഷൻ 26", "സെക്ഷൻ 23", "സെക്ഷൻ 33"],
        correct: 1
    }
];
